{"keras_version": "2.0.3", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, null, null, 3], "name": "input_1"}, "name": "input_1"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block1_conv1", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block1_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 64, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block1_conv2", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block1_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block1_pool"}, "name": "block1_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block2_conv1", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block2_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 128, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block2_conv2", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block2_conv2"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block2_pool"}, "name": "block2_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block3_conv1", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block3_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block3_conv2", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block3_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block3_conv3", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block3_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 256, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block3_conv4", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block3_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv4", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block3_pool"}, "name": "block3_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block4_conv1", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block4_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block4_conv2", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block4_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block4_conv3", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block4_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block4_conv4", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block4_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv4", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block4_pool"}, "name": "block4_pool"}, {"class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block5_conv1", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block5_conv1"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block5_conv2", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block5_conv2"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block5_conv3", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block5_conv3"}, {"class_name": "Conv2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"padding": "same", "kernel_regularizer": null, "strides": [1, 1], "filters": 512, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "name": "block5_conv4", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "activation": "relu", "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "trainable": true}, "name": "block5_conv4"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv4", 0, 0, {}]]], "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "block5_pool"}, "name": "block5_pool"}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "name": "global_average_pooling2d_1"}], "name": "vgg19", "input_layers": [["input_1", 0, 0]], "output_layers": [["global_average_pooling2d_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow"}